-- Создаем таблицу employees
CREATE TABLE employees (
  id SERIAL PRIMARY KEY,
  name VARCHAR(20) NOT NULL,
  patronymic VARCHAR(20) NOT NULL,
  surname VARCHAR(20) NOT NULL,
  post TEXT NOT NULL,
  subunit TEXT NOT NULL
);
ALTER SEQUENCE employees_id_seq RESTART WITH 1; 

-- Создаем таблицу DateOfVacation
CREATE TABLE DateOfVacation (
    id SERIAL PRIMARY KEY,
    employee_id INTEGER REFERENCES employees(id) ON DELETE CASCADE ON UPDATE CASCADE,
    vacation_start DATE NOT NULL,
    vacation_finish DATE NOT NULL
);
ALTER SEQUENCE dateofvacation_id_seq RESTART WITH 1; 
-- Создаем таблицу norms
CREATE TABLE norms (
  month VARCHAR(20) PRIMARY KEY,
  month_number INT NOT NULL,
  norm INT NOT NULL
);
-- Заполнение таблицы norms
INSERT INTO norms (month, month_number, norm) VALUES
  ('Январь', 1, 3),
  ('Февраль', 2, 11),
  ('Март', 3, 5),
  ('Апрель', 4, 6),
  ('Май', 5, 4),
  ('Июнь', 6, 8),
  ('Июль', 7, 10),
  ('Август', 8, 17),
  ('Сентябрь', 9, 18),
  ('Октябрь', 10, 19),
  ('Ноябрь', 11, 20),
  ('Декабрь', 12, 10);
  
-- Заполняем таблицу employees
INSERT INTO employees (name, patronymic, surname, post, subunit) VALUES
  ('Иван', 'Иванович', 'Иванов', 'Программист', 'Отдел разработки'),
  ('Мария', 'Петровна', 'Петрова', 'Дизайнер', 'Отдел дизайна'),
  ('Алексей', 'Сергеевич', 'Сидоров', 'Менеджер', 'Отдел продаж'),
  ('Ольга', 'Алексеевна', 'Смирнова', 'Аналитик', 'Отдел анализа'),
  ('Дмитрий', 'Владимирович', 'Кузнецов', 'Тестировщик', 'Отдел тестирования'),
  ('Екатерина', 'Андреевна', 'Соколова', 'Маркетолог', 'Отдел маркетинга'),
  ('Сергей', 'Васильевич', 'Попов', 'Специалист по работе с клиентами', 'Отдел продаж'),
  ('Анна', 'Сергеевна', 'Михайлова', 'Контент-менеджер', 'Отдел маркетинга'),
  ('Максим', 'Игоревич', 'Федоров', 'Системный администратор', 'Отдел IT'),
  ('Елена', 'Викторовна', 'Козлова', 'Бухгалтер', 'Финансовый отдел'),
  ('Александр', 'Николаевич', 'Морозов', 'Юрист', 'Юридический отдел'),
  ('Наталья', 'Александровна', 'Волкова', 'HR-менеджер', 'HR отдел'),
  ('Андрей', 'Валерьевич', 'Петров', 'Руководитель проекта', 'Отдел разработки'),
  ('Ирина', 'Юрьевна', 'Савельева', 'Ведущий дизайнер', 'Отдел дизайна'),
  ('Евгений', 'Дмитриевич', 'Романов', 'Руководитель отдела продаж', 'Отдел продаж'),
  ('Татьяна', 'Валерьевна', 'Белова', 'Главный бухгалтер', 'Финансовый отдел'),
  ('Олег', 'Викторович', 'Кузьмин', 'Заместитель директора по маркетингу', 'Отдел маркетинга'),
  ('Светлана', 'Игоревна', 'Соловьева', 'Менеджер по персоналу', 'HR отдел'),
  ('Денис', 'Алексеевич', 'Васильев', 'Программист', 'Отдел разработки'),
  ('Марина', 'Владимировна', 'Ковалева', 'Дизайнер', 'Отдел дизайна'),
  ('Николай', 'Сергеевич', 'Яковлев', 'Менеджер', 'Отдел продаж'),
  ('Виктория', 'Александровна', 'Новикова', 'Аналитик', 'Отдел анализа'),
  ('Павел', 'Владимирович', 'Козлов', 'Тестировщик', 'Отдел тестирования'),
  ('Евгения', 'Николаевна', 'Кузнецова', 'Маркетолог', 'Отдел маркетинга');
  
-- Добавляем отпуска, чтобы общая продолжительность для каждого сотрудника была 28 дней
INSERT INTO DateOfVacation (employee_id, vacation_start, vacation_finish) VALUES
  (1, '2024-01-01', '2024-01-15'),
  (1, '2024-01-17', '2024-01-23'),
  (2, '2024-03-01', '2024-03-15'),
  (2, '2024-05-10', '2024-05-24'),
  (3, '2024-05-10', '2024-05-24'),
  (3, '2024-07-01', '2024-07-15'),
  (4, '2024-07-01', '2024-07-15'),
  (4, '2024-09-01', '2024-09-15'),
  (5, '2024-09-01', '2024-09-15'),
  (5, '2024-11-10', '2024-11-24'),
  (6, '2024-11-10', '2024-11-24'),
  (6, '2024-01-15', '2024-01-29'),
  (7, '2024-02-16', '2024-03-01'),
  (7, '2024-03-05', '2024-03-18'),
  (8, '2024-04-05', '2024-04-19'),
  (8, '2024-06-10', '2024-06-24'),
  (9, '2024-06-10', '2024-06-24'),
  (9, '2024-08-01', '2024-08-15'),
  (10, '2024-08-01', '2024-08-15'),
  (10, '2024-10-01', '2024-10-15'),
  (11, '2024-10-01', '2024-10-15'),
  (11, '2024-12-01', '2024-12-15'),
  (12, '2024-12-01', '2024-12-15'),
  (12, '2024-02-18', '2024-03-01'),
  (13, '2024-01-20', '2024-02-03'),
  (13, '2024-03-10', '2024-03-24'),
  (14, '2024-03-10', '2024-03-24'),
  (14, '2024-05-05', '2024-05-19'),
  (15, '2024-05-05', '2024-05-19'),
  (15, '2024-07-05', '2024-07-19'),
  (16, '2024-07-05', '2024-07-19'),
  (16, '2024-09-05', '2024-09-19'),
  (17, '2024-09-05', '2024-09-19'),
  (17, '2024-11-05', '2024-11-19'),
  (18, '2024-11-05', '2024-11-19'),
  (18, '2024-01-15', '2024-01-29'),
  (19, '2024-02-07', '2024-02-19'),
  (19, '2024-04-10', '2024-04-24'),
  (20, '2024-04-10', '2024-04-24'),
  (20, '2024-06-05', '2024-06-19'),
  (21, '2024-06-05', '2024-06-19'),
  (21, '2024-08-05', '2024-08-19'),
  (22, '2024-08-05', '2024-08-19'),
  (22, '2024-10-05', '2024-10-19'),
  (23, '2024-10-05', '2024-10-19'),
  (23, '2024-12-05', '2024-12-19'),
  (24, '2024-12-05', '2024-12-19'),
  (24, '2024-02-16', '2024-03-01');

UPDATE DateOfVacation 
SET vacation_finish = vacation_finish - INTERVAL '1 day';